Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: If statements can be nested indefinitely within other if statements, which provides you with complete flexibility for conditional execution of the various parts of your program.
es: Las sentencias if se pueden anidar indefinidamente dentro de otras sentencias if, lo cual proporciona una flexibilidad completa para ejecuciones condicionales en las diferentes partes de tu programa.

source: Array Operators
es: Operadores de Cadenas

source: The switch statement is similar to a series of IF statements on the same expression.
es: La sentencia switch es similar a una serie de sentencias IF en la misma expresión.

source: In many occasions, you may want to compare the same variable (or expression) with many different values, and execute a different piece of code depending on which value it equals to.
es: En muchas ocasiones, se quiere comparar la misma variable (o expresión) con nuchos valores diferentes, y ejecutar una parte de código distinta dependiendo de a qué valor es igual.

source: This is exactly what the switch statement is for.
es: Para ello sirve la sentencia switch.

source: The following two examples are two different ways to write the same thing, one using a series of if statements, and the other using the switch statement:
es: Los siguientes dos ejemplos son dos modos distintos de escribir la misma cosa, uno usa una serie de sentencias if, y el otro usa la sentencia switch:

source: if ($i == 0) {print "i equals 0";} if ($i == 1) {print "i equals 1";} if ($i == 2) {print "i equals 2";} switch ($i) {case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break;}
es: if ($i == 0) {print "i es igual a 0";} if ($i == 1) {print "i es igual a 1";} if ($i == 2) {print "i es igual a 2";} switch ($i) {case 0: print "i es igual a 0"; break; case 1: print "i es igual a 1"; break; case 2: print "i es igual a 2"; break;}

source: It is important to understand how the switch statement is executed in order to avoid mistakes.
es: Es importante entender cómo se ejecuta la sentencia switch para evitar errores.

source: The switch statement executes line by line (actually, statement by statement).
es: La sentencia switch ejecuta línea por línea (realmente, sentencia a sentencia).

source: In the beginning, no code is executed.
es: Al comienzo, no se ejecuta código.

source: Only when a case statement is found with a value that matches the value of the switch Only when a case statement is found with a value that matches the value of the switch expression does PHP begin to execute the statements.
es: Sólo cuando se encuentra una sentencia case con un valor que coincide con el valor de la expresión switch PHP comienza a ejecutar las sentencias.

source: PHP continues to execute the statements until the end of the switch block, or the first time it sees a break statement.
es: PHP continúa ejecutando las sentencias hasta el final del bloque switch, o la primera vez que vea una sentencia break.

source: If you don' t write a break statement at the end of a case's statement list, PHP will go on executing the statements of the following case.
es: Si no se escribe una sentencia break al final de una lista de sentencias case, PHP seguirá ejecutando las sentencias del siguiente case.

source: switch ($i) {case 0: print "i equals 0"; case 1: print "i equals 1"; case 2: print "i equals 2";}
es: switch ($i) {case 0: print "i es igual a 0"; case 1: print "i es igual a 1"; case 2: print "i es igual a 2";}

source: Here, if $i is equal to 0, PHP would execute all of the print statements!
es: Aquí, si $i es igual a 0, ¡PHP ejecutaría todas las sentecias print!

source: You would get the expected behavior ('i equals 2 'would be displayed) only if $i is equal to 2.
es: Si $i es igual a 1, PHP ejecutaría las últimas dos sentencias print y sólo si $i es igual a 2, se obtendría la conducta 'esperada' y solamente se mostraría 'i es igual a 2 '.

source: Thus, it is important not to forget break statements (even though you may want to avoid supplying them on purpose under certain circumstances).
es: Así, es importante no olvidar las sentencias break (incluso aunque pueda querer evitar escribirlas intencionadamente en ciertas circunstancias).

source: In a switch statement, the condition is evaluated only once and the result is compared to each case statement.
es: En una sentencia switch, la condición se evalúa sólo una vez y el resultado se compara a cada sentencia case.

source: In an elseif statement, the condition is evaluated again.
es: En una sentencia elseif, la condición se evalúa otra vez.

source: If your condition is more complicated than a simple compare and / or is in a tight loop, a switch may be faster.
es: Si tu condición es más complicada que una comparación simple y / o está en un bucle estrecho, un switch puede ser más rápido.

source: The statement list for a case can also be empty, which simply passes control into the statement list for the next case.
es: La lista de sentencias de un case puede también estar vacía, lo cual simplemente pasa el control a la lista de sentencias del siguiente case.

source: switch ($i) {case 0: case 1: case 2: print "i is less than 3 but not negative"; break; case 3: print "i is 3";}
es: switch ($i) {case 0: case 1: case 2: print "i es menor que 3, pero no negativo"; break; case 3: print "i es 3";}

source: A special case is the default case.
es: Un case especial es el default case.

source: This case matches anything that wasn 't matched by the other cases, and should be the last case statement.
es: Este case coincide con todo lo que no coincidan los otros case.

source: switch ($i) {case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break; default: print "i is not equal to 0, 1 or 2";}
es: switch ($i) {case 0: print "i es igual a 0"; break; case 1: print "i es igual a 1"; break; case 2: print "i es igual a 2"; break; default: print "i no es igual a 0, 1 o 2";}

source: The case expression may be any expression that evaluates to a simple type, that is, integer or floating-point numbers and strings.
es: La expresión case puede ser cualquier expresión que se evalúe a un tipo simple, es decir, números enteros o de punto flotante y cadenas de texto.

source: Arrays or objects cannot be used here unless they are dereferenced to a simple type.
es: No se pueden usar aquí ni arrays ni objetos a menos que se conviertan a un tipo simple.

source: The alternative syntax for control structures is supported with switches.
es: La sintaxis alternativa para las estructuras de control está también soportada con switch.

source: For more information, see Alternative syntax for control structures.
es: Para más información, ver Sintaxis alternativa para estructuras de control.

source: switch ($i): case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break; default: print "i is not equal to 0, 1 or 2"; endswitch;
es: switch ($i): case 0: print "i es igual 0"; break; case 1: print "i es igual a 1"; break; case 2: print "i es igual a 2"; break; default: print "i no es igual a 0, 1 o 2"; endswitch;

source: declare
es: require()

source: while loops are the simplest type of loop in PHP.
es: Los bucles while son los tipos de bucle más simples en PHP.

source: They behave just like their C counterparts.
es: Se comportan como su contrapartida en C.

source: The basic form of a while statement is:
es: La forma básica de una sentencia while es:

source: while (expr) statement
es: while (expr) sentencia

source: The meaning of a while The meaning of a while statement is simple.
es: El significado de una sentencia while es simple.

source: It tells PHP to execute the nested statement( s) repeatedly, as long as the while expression evaluates to TRUE.
es: Le dice a PHP que ejecute la( s) sentencia(s) anidada(s) repetidamente, mientras la expresión while se evalúe como TRUE.

source: The value of the expression is checked each time at the beginning of the loop, so even if this value changes during the execution of the nested statement( s), execution will not stop until the end of the iteration (each time PHP runs the statements in the loop is one iteration).
es: El valor de la expresión es comprobado cada vez al principio del bucle, así que incluso si este valor cambia durante la ejecución de la( s) sentencia(s) anidada(s), la ejecución no parará hasta el fin de la iteración (cada vez que PHP ejecuta las sentencias en el bucle es una iteración).

source: Sometimes, if the while expression evaluates to FALSE from the very beginning, the nested statement( s) won't even be run once.
es: A veces, si la expresión while se evalúa como FALSE desde el principio de todo, la( s) sentencia(s) anidada(s) no se ejecutarán ni siquiera una vez.

source: Like with the if statement, you can group multiple statements within the same while loop by surrounding a group of statements with curly braces, or by using the alternate syntax:
es: Como con la sentencia if, se pueden agrupar multiples sentencias dentro del mismo bucle while encerrando un grupo de sentencias con llaves, o usando la sintaxis alternativa:

source: while (expr): statement... endwhile;
es: while (expr): sentencia... endwhile;

source: The following examples are identical, and both print numbers from 1 to 10:
es: Los siguientes ejemplos son idénticos, y ambos imprimen números del 1 al 10:

source: /* example 1 * / $i = 1; while ($i = 10) {print $i++; / * the printed value would be $i before the increment (post-increment) * /} / * example 2 * / $i = 1; while ($i = 10): print $i; $i++; endwhile;
es: /* ejemplo 1 * / $i = 1; while ($i = 10) {print $i++; / * el valor impreso sería $i antes del incremento (post-incremento) * /} / * ejemplo 2 * / $i = 1; while ($i = 10): print $i; $i++; endwhile;

source: This manual is © Copyright 1997 - 2003 by the PHP Documentation Group.
es: Este manual es © Copyright 1997, 1998, 1999, 2000, 2001, 2002 por el Grupo de documentación de PHP.

source: The members of this group are listed on the front page of this manual.
es: Los miembros de este grupo se encuentran listados en la primera página de este manual.

source: This manual can be redistributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
es: Este manual puede ser redistribuido bajo los términos de la "GNU General Public License" publicada por la "Free Software Foundation"; tanto bajo la versión 2 de esta licencia o bajo versiones posteriores.

source: The 'Extending PHP 4.0' section of this manual is copyright © 2000 by Zend Technologies, Ltd.
es: La sección 'Extendiendo PHP 4.0' de este manual es copyright © 2000 por Zend Technologies, Ltd.

source: This material may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later (the latest version is presently available at http: / /www.opencontent.org / openpub /).
es: Este material puede ser distribuido solamente bajo los terminos y condiciones de la Open Publication License, v1.0 ó posterior (la última versión está disponible en http: / /www.opencontent.org / openpub /).

source: PHP 3 includes support for a network-based debugger.
es: El debugger funciona conectandose a un puerto TCP cada vez que PHP comienza.

source: PHP 4 does not have an internal debugging facility.
es: Esta información se entiende que que es para un "servidor de debugger" que puede ejecutarse en un IDE o en un editor programabler (como Emacs).

source: You can use one of the external debuggers though.
es: Establezca un puerto TCP para el debugger en el archivo de configuración (debugger.port) y activelo (debugger.enabled).

source: The Zend IDE includes a debugger, and there are also some free debugger extensions like DBG at http: / /dd.cron.ru / dbg /, the Advanced PHP Debugger (APD) or Xdebug which even has a compatible debugger interface as PHP 3's debugging functionality as is described in this section.
es: En su código, ejecute "debugger_on (host)", donde host es la dirección IP o el nombre de el host ejecutando un módulo de escucha de TCP.

source: Other incompatibilities
es: Otras incompatibilidades

source: Using the Debugger
es: Protocolo del debugger

source: Appendix D.
es: Apéndice D.

source: Debugging PHP
es: El debugger de PHP

source: The PHP 3 debugger protocol is line-based.
es: El protocolo del debugger está basado en líneas.

source: Each line has a type, and several lines compose a message.
es: Cada línea tiene un tipo, y varias línea componen un mensaje.

source: Each message starts with a line of the type start and terminates with a line of the type end.
es: Cada mensaje comienza con una línea del tipo start y termina con una línea del tipo end.

source: PHP 3 may send lines for different messages simultaneously.
es: PHP puede enviar líneas para diferentes mensajes simultaneamente.

source: A line has this format:
es: Una línea tiene este formato:

source: Date in ISO 8601 format (yyyy - mm - dd)
es: Fecha en formato ISO 8601 (aaaa - mm - dd)

source: Time including microseconds: hh: mm: uuuuuu
es: Hora incluyendo microsegundos: hh: mm: uuuuuu

source: DNS name or IP address of the host where the script error was generated.
es: Nombre DNS o dirección IP del host donde el script de error fue generado.

source: PID (process id) on host of the process with the PHP 3 script that generated this error.
es: PID (id proceso) en el host del proceso en que el script de PHP generó este error.

source: Type of line.
es: Tipo de la línea.

source: Tells the receiving program about what it should treat the following data as:
es: Dice al programa programa que recibe que debe considerar los datos siguientes como:

source: Table D-1.
es: Tabla D-1.

source: Debugger Line Types
es: Tipos de línea del debugger

source: Name
es: Nombre

source: Tells the receiving program that a debugger message starts here.
es: Informa al programa que recibe que un mensaje del debugger comienza aqui.

source: The contents of data will be the type of error message, listed below.
es: El contenido de data será el tipo del mensaje de error, listados debajo.

source: The PHP 3 error message.
es: El mensaje de error de PHP.

source: File name and line number where the error occurred.
es: Nombre del fichero y número de línea donde ocurrió el error.

source: The first location line will always contain the top-level location. data will contain file: line.
es: La primera línea con location siempre contendrá la localización de mayor nivel. data contendrá fichero: línea.

source: There will always be a location line after message and after every function.
es: Siempre habrá una línea de tipo location después de message y después de cada function.

source: Number of frames in the following stack dump.
es: Número de marcos en la pila.

source: If there are four frames, expect information about four levels of called functions.
es: Si hay cuatro marcos, espere información sobre los cuatro niveles de las funciones llamadas.

source: If no "frames" line is given, the depth should be assumed to be 0 (the error occurred at top-level).
es: Si no hay una línea de tipo "frames", la profundidad se asume que es 0 (el error ocurrió en el nivel superior).

source: Name of function where the error occurred.
es: Nombre de la función donde ocurrió el error.

source: Will be repeated once for every level in the function call stack.
es: Será repetida una vez por cada nivel en la pila de funciones.

source: Tells the receiving program that a debugger message ends here.
es: Informa al programa que recibe que el mensaje del debugger termina aqui.

source: Line data.
es: Línea de datos.

source: Table D-2.
es: Tabla D-2.

source: Debugger Error Types
es: Tipos de error del debugger

source: PHP 3 Internal
es: PHP Internal

source: Example D-1.
es: Ejemplo D-1.

source: Example Debugger Message
es: Ejemplo de mensaje del debugger

source: Be sure to read the installation instructions carefully and note that you need both flex and bison installed to compile PHP.
es: Be sure to read the installation Be sure to read the installation instructions carefully and note that you need both flex and bison installed to compile PHP.

source: Example 52-1.
es: Ejemplo 52-1.

source: Stream open options
es: Siguiente

source: Example 51-1.
es: Ejemplo 51-1.

source: Example 51-2.
es: Ejemplo 51-2.

source: Example 51-3.
es: Ejemplo 51-3.

source: When track_vars is on, it creates some associative arrays, the most important here is: $_POST (this used to be called $HTTP_POST_VARS in PHP versions prior 4.1.0).
es: When track_vars is on, it creates some associative arrays, the most important here is: $_POST (this used to be called $HTTP_POST_VARS in PHP When track_vars is on, it creates some associative arrays, the most important here is: $_POST (this used to be called $HTTP_POST_VARS in PHP versions prior 4.1.0).

source: Table 23-1.
es: Tabla 23-1.

source: Table 23-2.
es: Tabla 23-2.

source: Table 23-3.
es: Tabla 23-3.

source: Example 23-1.
es: Ejemplo 23-1.

source: Example 23-2.
es: Ejemplo 23-2.

source: Functions restricted / disabled by safe mode
es: Modo Seguro (Safe Mode)

source: The following applies to 3.0.7 and later.
es: Todo lo siguiente se aplica a partir de la versión 3.0.7 y posterior.

source: Internally in PHP a connection status is maintained.
es: Internamente en PHP se mantiene el estado de la conexión.

source: There are 3 possible states:
es: Hay 3 posibles estados:

source: 1 - ABORTED
es: 1 - ABORTED (Abortado)

source: 2 - TIMEOUT
es: 2 - TIMEOUT (Fuera de tiempo)

source: When a PHP script is running normally the NORMAL state, is active.
es: Cuando un script PHP se está ejecutando se activa el estado NORMAL.

source: If the remote client disconnects the ABORTED state flag is turned on.
es: Si el cliente remoto se desconecta, se pasa al estado ABORTED.

source: A remote client disconnect is usually caused by the user hitting his STOP button.
es: Esto suele ocurrir cuando el usuario pulsa en el botón STOP del navegador.

source: If the PHP-imposed time limit (see set_time_limit()) is hit, the TIMEOUT state flag is turned on.
es: Si se alcanza el límite de tiempo impuesto por PHP (ver set_time_limit()), se pasa al estado TIMEOUT.

source: You can decide whether or not you want a client disconnect to cause your script to be aborted.
es: Puedes decidir si quieres que la desconexión de un cliente cause que tu script sea abortado.

source: Sometimes it is handy to always have your scripts run to completion even if there is no remote browser receiving the output.
es: Algunas veces es cómodo que tus scripts se ejecuten por completo, incluso si no existe ya un navegador remoto que reciba la salida.

source: The default behaviour is however for your script to be aborted when the remote client disconnects.
es: El comportamiento por defecto es sin embargo, que tu script se aborte cuando el cliente remoto se desconecta.

source: This behaviour can be set via the ignore_user_abort php.ini directive as well as through the corresponding "php_value ignore_user_abort" Apache .conf directive or with the ignore_user_abort() function.
es: Este comportamiento puede ser configurado vía la directiva ignore_user_abort en el fichero php3.ini, o también con la función ignore_user_abort().

source: If you do not tell PHP to ignore a user abort and the user aborts, your script will terminate.
es: Si no le espeficicas al PHP que cuando un usuario aborte lo ignore, tu script terminará su ejecución.

source: The one exception is if you have registered a shutdown function using register_shutdown_function().
es: La única excepción es si tienes registrada un función de desconexión usando la función register_shutdown_function().

source: With a shutdown function, when the remote user hits his STOP button, the next time your script tries to output something PHP will detect that the connection has been aborted and the shutdown function is called.
es: Con una función de desconexión, cuando un usuario remoto pulsa en el botón STOP, la próxima vez que tu script intenta mostrar algo, PHP detecta que la conexión ha sido abortada y se llama a la función de desconexión.

source: This shutdown function will also get called at the end of your script terminating normally, so to do something different in case of a client disconnect you can use the connection_aborted() function.
es: Esta función de desconexión también se llama al final de la ejecución de tu script cuando se ha ejecutado normalmente, de manera que si quieres hacer algo diferente en caso de que un cliente se haya desconectado, puedes usar la función connection_aborted().

source: This function will return TRUE if the connection was aborted.
es: Esta función devuelve TRUE si la conexión fue abortada.

source: Your script can also be terminated by the built-in script timer.
es: Vuestro script también se puede terminar por un temporizador interno.

source: The default timeout is 30 seconds.
es: El timeout por defecto es de 30 segundos.

source: It can be changed using the max_execution_time php.ini directive or the corresponding "php_value max_execution_time" Apache .conf directive as well as with the set_time_limit() function.
es: Se puede cambiar usando la directiva max_execution_time en el fichero php.ini o la correspondiente directiva php_max_execution_time en la configuración del servidor de páginas Apache, como también con la función set_time_limit().

source: When the timer expires the script will be aborted and as with the above client disconnect case, if a shutdown function has been registered it will be called.
es: Cuando el temporizador expira, el script se aborta como en el caso de la desconexión del cliente, de manera que si se ha definido una función de desconexión, esta se llamará.

source: Within this shutdown function you can check to see if a timeout caused the shutdown function to be called by calling the connection_timeout() function.
es: Dentro de esta función de desconexión, puedes comprobar si fue el timeout el que causó que se llamara a la función de desconexión, llamando a la función connection_timeout().

source: This function will return TRUE if a timeout caused the shutdown function to be called.
es: Esta función devolverá verdadero si el timeout causa que se llame a la función de desconexión.

source: One thing to note is that both the ABORTED and the TIMEOUT states can be active at the same time.
es: Hay que destacar que ambos, el estado ABORTED y el TIMEOUT, se pueden activar al mismo tiempo.

source: This is possible if you tell PHP to ignore user aborts.
es: Esto es posible si le dices a PHP que ignore las desconexiones intencionadas de los usuarios.

source: PHP will still note the fact that a user may have broken the connection, but the script will keep running.
es: PHP aún notará el hecho de que el usuario puede haberse desconectado, pero el script continuará ejecutándose.

source: If it then hits the time limit it will be aborted and your shutdown function, if any, will be called.
es: Si se alcanza el tiempo límite de ejecución será abortado y, si se ha definido una función de desconexión, esta será llamada.

source: At this point you will find that connection_timeout() and connection_aborted() return TRUE.
es: En este punto, encontrarás que las funciones connection_timeout() y connection_aborted() devuelven verdadero.

source: You can also check both states in a single call by using the connection_status().
es: Puedes comprobar ambos estados de una manera simple usando la función connection_status().

source: This function returns a bitfield of the active states.
es: Esta función devuelve un campo de bit de los estados activos.
